docs/tutorials/working-with-blocks.org
** Factories for struct blocks

Add the following code to ~home/factories.py~.

#+begin_src python :eval no :tangle "../../home/factories.py" :comments link
  import factory
  from wagtail_factories import StructBlockFactory

  from home.blocks import ScheduledFeedingBlock


  class ScheduledFeedingBlockFactory(StructBlockFactory):
      time = factory.Faker("time_object")
      portions = factory.Faker("random_int", min=1, max=100)
      food = factory.Faker(
          "random_element", elements=["kibble", "tuna", "salmon", "carrots"]
      )

      class Meta:
          model = ScheduledFeedingBlock
#+end_src

We have:

- created a ~StructBlockFactory~ subclass for our ~StructBlock~ subclass;
- added one declaration for each field on the block definition; and
- added an inner ~Meta~ class with a ~model~ attribute which is the corresponding block class.

The ~Meta.model~ declaration is essential: wagtail-factories needs this to create values of the correct type. It should be the relevant block class.

In this example, we're using the API exposed by ~factory.Faker~. This helps us to generate reasonable-looking defaults for fields we don't specify explicit values for when creating block instances.

#+begin_src python :exports both :results value pp
  import home.factories as f


  f.ScheduledFeedingBlockFactory()
#+end_src

#+RESULTS:
: StructValue([('time', datetime.time(7, 51, 46, 566552)),
:              ('portions', 82),
:              ('food', 'carrots')])

We can also specify values for some or all of the fields.

#+begin_src python :exports both :results value pp
  f.ScheduledFeedingBlockFactory(
      portions=3,
      food="kibble",
  )
#+end_src

#+RESULTS:
: StructValue([('time', datetime.time(11, 40, 0, 806921)),
:              ('portions', 3),
:              ('food', 'kibble')])

In the next section, we'll learn how to create and use factories for another of Wagtail's compound block types: ~StreamBlock~.

** Stream block factories

Looking back at the definition of ~PetBlock~, we can see that it contains a stream block definition.

#+begin_src python :eval never :exports code
  class PetStoryBlock(blocks.StreamBlock):
      text = blocks.TextBlock()
      link = blocks.URLBlock()
      image = ImageBlock()


  class PetBlock(blocks.StructBlock):
      ...
      story = PetStoryBlock()
      ...
#+end_src

Create a factory for ~PetStoryBlock~ in ~home/factories.py~. We'll use faker instances for the atomic fields, and a ~SubFactory~ for the nested ~ImageBlock~.

#+begin_src python :eval no :tangle "../../home/factories.py" :comments link
  import factory
  from wagtail_factories import ImageBlockFactory, StreamBlockFactory

  from home.blocks import PetStoryBlock


  class PetStoryBlockFactory(StreamBlockFactory):
      image = factory.SubFactory(ImageBlockFactory)
      text = factory.Faker("sentence")
      link = factory.Faker("uri")

      class Meta:
          model = PetStoryBlock
#+end_src

Again, note the inner ~Meta~ class with ~model~ definition - this is required.

*** Using a stream block factory

Let's try using our new stream block value to generate a value.

#+begin_src python :exports both :results value pp
  f.PetStoryBlockFactory()
#+end_src

#+RESULTS:
: <StreamValue []>

With no parameters, an empty ~StreamValue~ is generated.

Given that a ~StreamValue~ is an ordered sequence type, how do we specify values for its elements? wagtail-factories supports a syntax for declaring parameters that includes indices for list block and stream block factories. For stream block factories, that syntax comes in two flavours:

1. a "default value" flavour; and
2. a "specified value" flavour.

The default value flavour looks like this:

#+begin_quote
<index>=<block name string>
#+end_quote

So, to create an instance of ~PetStoryBlock~ where the first element is a text block, we would do the following:

#+begin_src python :exports both :results value pp
  f.PetStoryBlockFactory(**{"0": "text"})
#+end_src

#+RESULTS:
: <StreamValue [<block text: 'Various since short.'>]>

This creates a block instance at index 0 using a default value as provided by the ~text~ declaration on ~PetStoryBlockFactory~.

Ideally, we wouldn't need the dict-unpacking to insert the keyword-argument parameters, but Python identifiers cannot begin with a numeric character. This will not be an issue when used in the context of a page (or other containing model), as you'll see in later examples.

The syntax for the "specified value" flavour looks like this:

#+begin_quote
<index>__<block name>=<value>
#+end_quote

For example:

#+begin_src python :exports both :results value pp
  f.PetStoryBlockFactory(**{"0__text": "hello"})
#+end_src

#+RESULTS:
: <StreamValue [<block text: 'hello'>]>

This lets us specify the position of the block in the stream, the type of block, and its value. We can combine these two syntaxes arbitrarily, and create streams with multiple elements:

#+begin_src python :exports both :results value pp
  f.PetStoryBlockFactory(**{"0__text": "hello", "1": "link", "2": "text"})
#+end_src

#+RESULTS:
: <StreamValue [<block text: 'hello'>, <block link: 'http://baxter-harris.org/categories/app/searchlogin.html'>, <block text: 'Box cut better matter.'>]>

However, indices /must/ start at zero, and /must/ be sequential.

#+begin_src python :exports code :results value pp :eval no
  f.PetStoryBlockFactory(**{"0": "link", "7": "link"})
#+end_src

#+begin_quote
wagtail_factories.builder.InvalidDeclaration:
  Parameters for <PetStoryBlockFactory for <class 'home.blocks.PetStoryBlock'>>
  missing required index 1
#+end_quote

We can also use double-underscores to traverse the block definition tree, and specify values for nested compound blocks, such as the image block option in ~PetStoryBlock~.

#+begin_src python :exports both :results value pp
  with_image = f.PetStoryBlockFactory(**{"0__image__decorative": True})
  with_image[0].value.decorative
#+end_src

#+RESULTS:
: True

This declaration can be read as:

#+begin_quote
<index>__<block name>__<block field>=<value>
#+end_quote

To specify multiple values for a particular nested block, we can add declarations with the same ~<index>__<block_name>~ prefix.

#+begin_src python :exports both :results value pp
  with_image = f.PetStoryBlockFactory(
      ,**{
          "0__image__decorative": False,
          "0__image__alt_text": "An orange cat lying in the sun",
          "0__image__image__image__file__color": "orange",
      }
  )

  with_image[0].value.decorative, with_image[0].value.contextual_alt_text
#+end_src

#+RESULTS:
: (False, 'An orange cat lying in the sun')

** Factories for list blocks

With the nested factory definitions taken care of, we can now create a factory for our ~PetBlock~.

#+begin_src python :eval no :tangle "../../home/factories.py" :comments link
  from wagtail_factories import (
      CharBlockFactory,
      ListBlockFactory,
      PageFactory,
      StreamFieldFactory,
  )
  from home.blocks import PetBlock, get_colour_choices


  class PetBlockFactory(StructBlockFactory):
      story = StreamFieldFactory(PetStoryBlockFactory)
      name = factory.Faker("name")
      date_of_birth = factory.Faker("date_object")
      feeding_schedule = ListBlockFactory(ScheduledFeedingBlockFactory)
      colour = factory.Faker(
          "random_element", elements=[x[0] for x in get_colour_choices()]
      )
      picture = factory.SubFactory(ImageBlockFactory)

      class Meta:
          model = PetBlock
#+end_src

This example illustrates an important point:

- when creating a factory with nested block factories, we must use ~factory.SubFactory~ to refer to those sub-factories lazily; /unless/
- the corresponding sub-block is a ~StreamBlock~, in which case we can use ~StreamFieldFactory~[fn:1]; /or/
- we're providing a value/factory by other means (e.g. a literal value, a faker instance); /or/
- the corresponding sub-block is a ~ListBlock~.

If the corresponding sub-block is a ~ListBlock~, we use ~ListBlockFactory~, as seen in the declaration for ~feeding_schedule~, above.

The syntax for declaring values for list block elements is similar to that of stream block factories, except:

- there is no shorthand for providing a default value; and
- we do not need to specify the block type, as list block values are homogenous sequences.

The syntax is:

#+begin_quote
<index>=<value>
#+end_quote

Let's create some ~PetBlock~ instances, providing values for the feeding schedule.

#+begin_src python :exports both :results value pp
  f.PetBlockFactory()
#+end_src

#+RESULTS:
: StructValue([('story', <StreamValue []>),
:              ('name', 'Jordan Nunez'),
:              ('date_of_birth', datetime.date(2014, 1, 14)),
:              ('feeding_schedule', <ListValue: []>),
:              ('colour', 'tabby'),
:              ('picture', <Image: An image>)])

Without parameters, an empty ~ListValue~ is generated for ~feeding_schedule~. Let's add some data for a pet that loves tuna.

#+begin_src python :exports both :results value pp
  from datetime import time

  f.PetBlockFactory(
      feeding_schedule__0__food="tuna",
      feeding_schedule__0__time=time(6, 0),
      feeding_schedule__1__food="tuna",
      feeding_schedule__1__time=time(12, 0),
      feeding_schedule__2__food="tuna",
      feeding_schedule__2__time=time(18, 0),
  )["feeding_schedule"]
#+end_src

#+RESULTS:
: <ListValue: [StructValue([('time', datetime.time(6, 0)), ('portions', 80), ('food', 'tuna')]), StructValue([('time', datetime.time(12, 0)), ('portions', 22), ('food', 'tuna')]), StructValue([('time', datetime.time(18, 0)), ('portions', 83), ('food', 'tuna')])]>

If we only care /when/ the pet is fed, we can declare the times only, and the factory mechanisms will take care of the rest.

#+begin_src python :exports both :results value pp
  f.PetBlockFactory(
      feeding_schedule__0__time=time(6, 0),
      feeding_schedule__1__time=time(12, 0),
      feeding_schedule__2__time=time(18, 0),
      feeding_schedule__3__time=time(23, 0),
  )["feeding_schedule"]
#+end_src

#+RESULTS:
: <ListValue: [StructValue([('time', datetime.time(6, 0)), ('portions', 53), ('food', 'tuna')]), StructValue([('time', datetime.time(12, 0)), ('portions', 61), ('food', 'kibble')]), StructValue([('time', datetime.time(18, 0)), ('portions', 30), ('food', 'kibble')]), StructValue([('time', datetime.time(23, 0)), ('portions', 42), ('food', 'carrots')])]>

As with stream block factories, the aggregated block indices must result in an uninterrupted sequence of integers starting from 0.

