docs/tutorials/working-with-blocks.org
** Tying it all together

Let's create our final block factories, and bundle them into the ~PetPageFactory~.

~StreamBlockFactory~ supports sub-classing, just like ~StreamBlock~, so create the following factories in ~home/factories.py~.

#+begin_src python :eval no :tangle "../../home/factories.py" :comments link
  from home.blocks import CatBlock, DogBlock


  class CatBlockFactory(PetBlockFactory):
      class Meta:
          model = CatBlock


  class DogBlockFactory(PetBlockFactory):
      class Meta:
          model = DogBlock
#+end_src

Then add them to our top-level ~PetsBlockFactory~.

#+begin_src python :eval no :tangle "../../home/factories.py" :comments link
  from home.blocks import PetsBlock


  class PetsBlockFactory(StreamBlockFactory):
      cat = factory.SubFactory(CatBlockFactory)
      dog = factory.SubFactory(DogBlockFactory)

      class Meta:
          model = PetsBlock
#+end_src

And finally, create ~PetPageFactory~.

#+begin_src python :eval no :tangle "../../home/factories.py" :comments link
  from wagtail_factories import (
      PageFactory,
      StreamFieldFactory,
  )
  from home.models import PetPage


  class PetPageFactory(PageFactory):
      pets = StreamFieldFactory(PetsBlockFactory)

      class Meta:
          model = PetPage
#+end_src

We've now built a family of factories from the bottom up, that mirrors our data-type definition. The following diagram illustrates the factory hierarchy we've created:

#+begin_example
PetPageFactory
└── pets (StreamFieldFactory)
    └── PetsBlockFactory (StreamBlockFactory)
        ├── cat (SubFactory)
        │   └── CatBlockFactory (PetBlockFactory)
        │       ├── story (StreamFieldFactory)
        │       │   └── PetStoryBlockFactory (StreamBlockFactory)
        │       │       ├── image (SubFactory → ImageBlockFactory)
        │       │       ├── text (Faker)
        │       │       └── link (Faker)
        │       ├── name (Faker)
        │       ├── date_of_birth (Faker)
        │       ├── feeding_schedule (ListBlockFactory)
        │       │   └── ScheduledFeedingBlockFactory (StructBlockFactory)
        │       │       ├── time (Faker)
        │       │       ├── portions (Faker)
        │       │       └── food (Faker)
        │       ├── colour (Faker)
        │       └── picture (SubFactory → ImageBlockFactory)
        └── dog (SubFactory)
            └── DogBlockFactory (PetBlockFactory)
                [same structure as CatBlockFactory]
#+end_example

This hierarchy shows how each factory builds upon its sub-factories, creating a complete system for generating test data for complex Wagtail stream field structures.

** Taking it for a spin

We can now test our factories, and get familiar with the syntax for declaring stream field structures. The simplest use is to call the ~PetPageFactory~ with no parameters.

#+begin_src python :exports both :results value pp
  page = f.PetPageFactory()
  page
#+end_src

#+RESULTS:
: <PetPage: Test page>

We can see that the stream field is empty.

#+begin_src python :exports both :results value pp
  page.pets
#+end_src

#+RESULTS:
: <StreamValue []>

Let's create a ~CatBlock~ and a ~DogBlock~ at the top level, using the factory defaults.

#+begin_src python :exports both :results value pp
  page = f.PetPageFactory(
      pets__0="cat",
      pets__1="dog",
  )
  page.pets
#+end_src

#+RESULTS:
: <StreamValue [<block cat: StructValue([('story', <StreamValue []>), ('name', 'David Perez'), ('date_of_birth', datetime.date(1992, 4, 2)), ('feeding_schedule', <ListValue: []>), ('colour', 'orange'), ('picture', <Image: An image>)])>, <block dog: StructValue([('story', <StreamValue []>), ('name', 'Jasmine Smith'), ('date_of_birth', datetime.date(1998, 8, 6)), ('feeding_schedule', <ListValue: []>), ('colour', 'orange'), ('picture', <Image: An image>)])>]>

The syntax used here mirrors the "default value" syntax described [[*Using a stream block factory][earlier]], with the added prefix for the stream field name:

#+begin_quote
pets__0="cat"

<model field name>__<stream field index>=<block name>
#+end_quote

Let's create an instance with some specific values for the ~CatBlock~ struct block.

#+begin_src python :exports both :results value pp
  page = f.PetPageFactory(
      pets__0__cat__name="Praxidike",
      pets__0__cat__colour="tabby",
  )
  page.pets[0]
#+end_src

#+RESULTS:
: <block cat: StructValue([('story', <StreamValue []>), ('name', 'Praxidike'), ('date_of_birth', datetime.date(2014, 4, 26)), ('feeding_schedule', <ListValue: []>), ('colour', 'tabby'), ('picture', <Image: An image>)])>

The declaration syntax here is:

#+begin_quote
<field>__<index>__<block name>__<field name>=<value>
#+end_quote

What about nested stream blocks? ~CatBlock.story~ is such a block. To declare values, we follow the syntactic patterns we've already encountered for stream values:

#+begin_quote
<index>=<block name> for a default; or
<index>__<block name>=<value>
#+end_quote

#+begin_src python :exports both :results value pp
  page = f.PetPageFactory(
      pets__0__cat__name="Praxidike",
      pets__0__cat__colour="tabby",
      pets__0__cat__story__0="text",
      pets__0__cat__story__1__link="https://http.cat/",
  )
  page.pets[0]
#+end_src

#+RESULTS:
: <block cat: StructValue([('story', <StreamValue [<block text: 'Certainly pattern run can.'>, <block link: 'https://http.cat/'>]>), ('name', 'Praxidike'), ('date_of_birth', datetime.date(1980, 12, 9)), ('feeding_schedule', <ListValue: []>), ('colour', 'tabby'), ('picture', <Image: An image>)])>

Prax needs to eat, so we should add some entries to the feeding schedule. Recall that the basic syntax for declaring list block elements is:

#+begin_quote
<index>=<value>
#+end_quote

This composes across field and factory boundaries as in our other examples. So, to specify values for the fields of a struct block:

#+begin_quote
<index>__<field name>=<value>
#+end_quote

#+begin_src python :exports both :results value pp
  page = f.PetPageFactory(
      pets__0__cat__feeding_schedule__0__time="06:00:00",
      pets__0__cat__feeding_schedule__1__food="tuna",
  )
  page.refresh_from_db()          # Normalizes the time value.
  page.pets[0].value["feeding_schedule"]
#+end_src

#+RESULTS:
: <ListValue: [StructValue([('time', datetime.time(6, 0)), ('portions', 77), ('food', 'carrots')]), StructValue([('time', datetime.time(3, 24, 8, 54000)), ('portions', 62), ('food', 'tuna')])]>

Finally, here's an example of specifying multiple fields on multiple stream elements.

#+begin_src python :exports both :results value pp
  page = f.PetPageFactory(
      pets__0__cat__name="Frog",
      pets__0__cat__story__0="text",
      pets__0__cat__story__1__link="https://http.cat/",
      pets__1="cat",
      pets__2__dog__name="Werner",
      pets__2__dog__colour="orange",
      pets__2__dog__feeding_schedule__0__time="08:30:00",
      pets__2__dog__feeding_schedule__1__time="12:30:00",
      pets__2__dog__feeding_schedule__2__time="18:30:00",
      pets__2__dog__story__0="text",
      pets__2__dog__picture__image__image__file__width=200,
  )

  page
#+end_src

#+RESULTS:
: <PetPage: Test page>


* Footnotes

[fn:1] Technically we can use ~factory.SubFactory~ instead of ~StreamFieldFactory~ for nested stream block factory declarations, and it is common to see this in the wild. However, this will result in errors if the containing block factory is used directly - i.e. not in the context of a containing model factory with a top level ~StreamFieldFactory~. This discrepancy should be resolved in a future release of wagtail-factories.
