home/factories.py

# [[file:../docs/tutorials/working-with-blocks.org::*Tying it all together][Tying it all together:1]]
from home.blocks import CatBlock, DogBlock


class CatBlockFactory(PetBlockFactory):
    class Meta:
        model = CatBlock


class DogBlockFactory(PetBlockFactory):
    class Meta:
        model = DogBlock


# Tying it all together:1 ends here

# [[file:../docs/tutorials/working-with-blocks.org::*Tying it all together][Tying it all together:2]]
from home.blocks import PetsBlock


class PetsBlockFactory(StreamBlockFactory):
    cat = factory.SubFactory(CatBlockFactory)
    dog = factory.SubFactory(DogBlockFactory)

    class Meta:
        model = PetsBlock


# Tying it all together:2 ends here

# [[file:../docs/tutorials/working-with-blocks.org::*Tying it all together][Tying it all together:3]]
from wagtail_factories import (
    PageFactory,
    StreamFieldFactory,
)

from home.models import PetPage


class PetPageFactory(PageFactory):
    pets = StreamFieldFactory(PetsBlockFactory)

    class Meta:
        model = PetPage


# Tying it all together:3 ends here
